syllabus.tex
% Created 2024-01-18 Thu 09:52
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage{lmodern}
\usepackage[T1]{fontenc}
\usepackage[top=1in, bottom=1.in, left=1in, right=1in]{geometry}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage[theorems, skins]{tcolorbox}
\usepackage[version=3]{mhchem}
\usepackage[numbers,super,sort&compress]{natbib}
\usepackage{natmove}
\usepackage{url}
\usepackage[cache=false]{minted}
\usepackage[strings]{underscore}
\usepackage[linktocpage,pdfstartview=FitH,colorlinks,
linkcolor=blue,anchorcolor=blue,
citecolor=blue,filecolor=blue,menucolor=blue,urlcolor=blue]{hyperref}
\usepackage{attachfile}
\usepackage{setspace}
\usepackage[left=1in, right=1in, top=1in, bottom=1in, nohead]{geometry}
\geometry{margin=1.0in}
\usepackage{amsmath}
\usepackage{graphicx}
\usepackage{epstopdf}
\usepackage{fancyhdr}
\usepackage{hyperref}
\usepackage[labelfont=bf]{caption}
\usepackage{setspace}
\def\dbar{{\mathchar'26\mkern-12mu d}}
\pagestyle{fancy}
\fancyhf{}
\renewcommand{\headrulewidth}{0.5pt}
\renewcommand{\footrulewidth}{0.5pt}
\lfoot{\today}
\cfoot{\copyright\ 2024 W.\ F.\ Schneider}
\rfoot{\thepage}
\title{University of Notre Dame\\Physical Chemistry for Chemical Engineers\\(CHE 30324)}
\author{Prof. William F.\ Schneider}
\def\dbar{{\mathchar'26\mkern-12mu d}}
\usepackage[small]{titlesec}
\titlespacing*{\section}
{0pt}{0.4\baselineskip}{0.0\baselineskip}
\titlespacing*{\subsection}
{0pt}{0.4\baselineskip}{0.0\baselineskip}
\titlespacing*{\subsubsection}
{0pt}{0.1\baselineskip}{0.0\baselineskip}
\setcounter{secnumdepth}{3}
\author{William F. Schneider}
\date{\today}
\title{CHE 30324 Syllabus}
\begin{document}

\begin{OPTIONS}
\end{OPTIONS}

\begin{center}
\textsc{\Large Physical Chemistry for Chemical Engineers (CHE 30324)}\\University of Notre Dame, Spring 2024
\end{center}
\begin{tabular*}{\textwidth}{@{\extracolsep{\fill}}l r}
\hline
Prof.\ Bill Schneider & Classroom: 215 DBRT\\
Office: 370 Nieuwland & Lecture MW 9:00-10:15\\
\email{wschneider@nd.edu}, phone 574-631-8754 & \http{https://github.com/wmfschneider/CHE30324} \\
\hline
\end{tabular*}

\section{Physical Chemistry}
\label{sec:orgc780fe8}
Chemical Engineers describe the macroscopic, material world around us in terms of classical models like Newton’s Laws of motion or the three Laws of Thermodynamics. Yet we know that the world is made up of femtoscopic objects, like atoms and electrons, that obey the very different rules of quantum mechanics. In this course we will learn how to use quantum mechanics to describe atoms, molecules, and their interactions with light, and how to use statistical mechanics to create a bridge between the bizarre quantum mechanical world and the familiar macroscopic one. We will learn how these two can be used to describe the physical properties of gases, liquids, and solids, and how they form the basis for understanding the mechanisms and rates of chemical reactions.

Physical chemistry is the fundamental physical basis of all Chemical Engineering. It is an exciting and lively topic, and much of the material will be new to you. I strongly encourage you to keep up with the reading and homework and to ask questions in class. Don't be bashful: if you don't understand something, chances are some of your classmates (and perhaps even your instructor!) don't either.
\section{(Suggested) Text}
\label{sec:orgd15ddc1}
Engel and Reid, \emph{Physical Chemistry}, Benjamin-Cummings, 2006 or 2009. Each topic will include some suggested problems from this book to give you practice with the material.
\section{Lecture}
\label{sec:org6d3f612}
The topics will be presented in a series of self-contained lectures. Attendance is expected, and you should be prepared to ask and answer questions. Chapter numbers are for the Second Edition of the suggested reading, ``Physical Chemistry''. In other editions the chapter numbers will vary, but titles will be the same. 

\begin{table}[htbp]
\caption{Brief Outline of Course Topics}
\centering
\begin{tabular}{ll}
\hline
Probability and the Boltzmann Distribution & Chapters 29-31\\[0pt]
Physical Properties of Gases and Liquids & Chapters 07-11\\[0pt]
Introduction to Quantum Mechanics & Chapters 12-14\\[0pt]
Basic Applications of Quantum Mechanics & Chapters 15-18\\[0pt]
Atomic Structure and Spectroscopy & Chapters 19-22\\[0pt]
Molecular Structure and Spectroscopy & Chapters 23-28\\[0pt]
Statistical Thermodynamics & Chapters 32-32\\[0pt]
Chemical Kinetics & Chapters 33-36\\[0pt]
\hline
\end{tabular}
\end{table}

\section{Web}
\label{sec:org1bbe5eb}
This syllabus, reading assignment, the homework assignments and solutions, a summary of the lecture schedule, and a \href{https://github.com/wmfschneider/CHE30324/tree/master/Outline/CHE30324-outline.pdf}{detailed course outline} are available on the web at \url{https://github.com/wmfschneider/CHE30324}.  If you want to get your own copy of all this material and understand a bit about how git works, see \url{http://rogerdudler.github.io/git-guide/}.  Or just download files directly from the git site. The source files are written using Org Mode (\url{https://orgmode.org/}), but you can read them using a regular text editor if you want to see under the hood.

A course calendar is available on Google at \href{https://calendar.google.com/calendar/b/1?cid=NWJwN2pmMjI5bTdoYmFvM2R0cXM2NjYzOThAZ3JvdXAuY2FsZW5kYXIuZ29vZ2xlLmNvbQ}{WFS Courses}.

\section{Homework}
\label{sec:orgd8e5af3}
Eleven graded problem sets will be distributed through the course website during the semester and will be due at the beginning of class on dates to be announced.  \textbf{Assignments turned in late will automatically lose 20\%, and those turned in after the solutions are posted will not be accepted.}  Your two lowest scores on homework will be dropped.  You may discuss the homework with your classmates, but \textbf{what you turn in must be your own work.} Homework will in general require some computations. complete your Homework within Python notebooks and will turn in your homework as a hardcopy of that notebook.

\subsection{Jupyter/Python}
\label{sec:org3903b13}
Homework will be distributed as \href{https://jupyter.org/}{Jupyter notebooks} (\url{https://jupyter.org}), an open source computing notebook environment that works within a web browser. Jupyter allows one to do among other things, create and execute \href{https://www.python.org/}{Python} (\url{https:/www.python.org}) programs, which are similar in syntax to Matlab. The easiest way to work within a notebook is through Google's \href{https://colab.research.google.com/notebooks/welcome.ipynb}{Colaboratory} (\url{https://colab.research.google.com/notebooks/welcome.ipynb}), a web-based platform, integrated with your Google drive, that allows you to create and execute notebooks without installing anything on your computer. Alternatively, you can download Jupyter and Python as one distribution, at \url{http://anaconda.com/download}. 

\subsection{Good practices}
\label{sec:orgd278f3c}
\textbf{Always} start solutions on a piece of paper. If the solution requires some python code, first write down pseudocode before creating in a notebook.

\section{Homework Defense}
\label{sec:orgde2c692}
To help me get to know you and how you are doing with the course, after each homework assignment seven of you will be chosen at random to meet with me to discuss your homework. Defenses will be in my office during office hours.

\section{Grading}
\label{sec:org71268e2}
Grades will be based on homework (25\%), three in-class exams (45\%), and a cumulative final (30\%).

\section{Academic honesty}
\label{sec:orgb9c07b9}
Should go without saying. This class follows the binding Code of Honor
at Notre Dame.  Any cheating or misrepresenting of work as your own
will be dealt with according to the policies of the University.  See \url{https://honorcode.nd.edu/}.

\section{Mental Health}
\label{sec:org7b5fb9e}
Care and Wellness Consultants provide
support and resources to students who are experiencing stressful or difficult
situations that may be interfering with academic progress. Through Care and
Wellness Consultants, students can be referred to The University Counseling
Center (for cost-free and confidential psychological and psychiatric services from
licensed professionals), University Health Services (which provides primary care,
psychiatric services, case management, and a pharmacy), and The McDonald
Center for Student Well Being (for problems with sleep, stress, and substance
use). Visit \href{https://supportandcare.nd.edu/}{https://supportandcare.nd.edu/}.

\section{Professional courtesy}
\label{sec:org5c96497}
As a courtesy to the instructor and your classmates, please refrain from
texting, web browsing, tweeting, chatting, updating, or using your phone or laptop for any
purpose during class time.  If you must use an electronic device, excuse
yourself from class.

\section{Office hours}
\label{sec:orgb8a633a}
The TA and instructor are happy to answer questions during regular office hours or by appointment if you need extra help. 

\begin{center}
\begin{tabular}{llll}
Dr. Bill Schneider & \email{wschneider@nd.edu} & F 10:30-11:30 & 370 NSH\\[0pt]
Marvin Diaz Segura & \email{mdiazseg@nd.edu} & Su 3:00-4:00 & 366 NSH\\[0pt]
Brendan Nieukirk & \email{bnieukir@nd.edu} & Th 4:00-4:45 & 356 Fitz\\[0pt]
Steven Yeo & \email{syeo@nd.edu} & W 1:30-2:00 & 366 NSH\\[0pt]
\end{tabular}
\end{center}

\section{Communications}
\label{sec:org3624862}
We will use \href{https://che30324-nd.slack.com}{Slack} as a tool for you to communicate questions during Office Hours or any time. Slack allows you to instant message with individuals (including the instructor and TAs), create smaller groups, or share your questions with the whole class. Join our Slack group \href{https://join.slack.com/t/che30324-sp24/shared\_invite/zt-2apiqg49t-\_dJ\_jm9AkZ83oHNaEh5cbw}{here}. 


\begin{table}[htbp]
\caption{Tentative Course Calendar}
\centering
\begin{tabular}{lllllll}
\hline
 & 1/17 & 1/19 &  & 3/18 & 3/20 & 3/22\\[0pt]
 & Welcome! &  & XXXXX & \textbf{HW 6} &  & \\[0pt]
\hline
1/22 & 1/24 & 1/26 &  & 3/25 & 3/27 & 3/29\\[0pt]
 &  &  &  & \textbf{HW 7} & \textbf{Exam 2} & \textbf{Good Friday}\\[0pt]
\hline
1/29 & 1/31 & 2/2 &  & 4/1 & 4/3 & 4/5\\[0pt]
\textbf{HW 1} &  &  &  & \textbf{Easter} &  & \\[0pt]
\hline
2/5 & 2/7 & 2/9 &  & 4/8 & 4/10 & 4/12\\[0pt]
\textbf{HW 2} &  &  &  & \textbf{HW 8} &  & \\[0pt]
\hline
2/12 & 2/14 & 2/16 &  & 4/15 & 4/17 & 4/19\\[0pt]
\textbf{HW 3} & \textbf{Exam 1} & \textbf{JPW} &  & \textbf{HW 9} & \textbf{Exam 3} & \\[0pt]
\hline
2/19 & 2/21 & 2/23 &  & 4/22 & 4/24 & 4/26\\[0pt]
 &  &  &  & \textbf{HW 10} &  & \\[0pt]
\hline
2/26 & 2/28 & 3/1 &  & 4/29 & 5/1 & 5/3\\[0pt]
\textbf{HW 4} &  &  &  &  & \textbf{Last class} & \textbf{HW 11}\\[0pt]
\hline
3/4 & 3/6 & 3/8 &  & 5/6 & 5/8 & \\[0pt]
\textbf{HW 5} &  &  &  &  & \textbf{Final Exam} & \\[0pt]
\hline
3/11 & 3/13 & 3/15 &  &  &  & \\[0pt]
\textbf{BREAK} & \textbf{BREAK} & \textbf{BREAK} &  &  &  & \\[0pt]
\hline
\end{tabular}
\end{table}
\end{document}